IDENTIFICATION DIVISION.
PROGRAM-ID. BIRTHDAY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATE-FIELD.
    05 DATE-AS-STR PIC X(8).
    05 DATE-PARTS REDEFINES DATE-AS-STR.
        10 YEAR PIC X(4).
        10 MONTH PIC X(2).
        10 DAY PIC X(2).
01 OUT PIC X(8).
PROCEDURE DIVISION.
MAIN-PROC.
    MOVE "20260523" TO DATE-AS-STR.
    MOVE DATE-AS-STR TO OUT.
    DISPLAY OUT.
    STOP RUN.
