IDENTIFICATION DIVISION.
PROGRAM-ID. CLEAN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 PHONE PIC X(14) VALUE "555-123-4567".
PROCEDURE DIVISION.
MAIN-PROC.
    DISPLAY PHONE.
    INSPECT PHONE REPLACING ALL "-" BY " ".
    DISPLAY PHONE.
    STOP RUN.
