IDENTIFICATION DIVISION.
PROGRAM-ID. CMPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(3) VALUE 6.
01 B PIC 9(3) VALUE 4.
01 C PIC 9(3) VALUE 0.
01 D PIC 9(3) VALUE 0.
01 I PIC 9(3) VALUE 0.
01 FACT PIC 9(6) VALUE 1.
PROCEDURE DIVISION.
MAIN-PROC.
    MULTIPLY A BY B GIVING C.
    DISPLAY C.
    DIVIDE A INTO C GIVING D.
    DISPLAY D.
    COMPUTE C = (A + B) * 2.
    DISPLAY C.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        MULTIPLY I BY FACT
    END-PERFORM.
    DISPLAY FACT.
    STOP RUN.
