IDENTIFICATION DIVISION.
PROGRAM-ID. COUNTER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN-PROC.
    PERFORM COUNT-UP.
    DISPLAY N.
    STOP RUN.
COUNT-UP.
    PERFORM UNTIL N = 10
        ADD 1 TO N
    END-PERFORM.
