IDENTIFICATION DIVISION.
PROGRAM-ID. COUNTING.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(20) VALUE "Anna banana".
01 CNT PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN-PROC.
    INSPECT NAME TALLYING CNT FOR ALL "a".
    DISPLAY CNT.
    MOVE 0 TO CNT.
    INSPECT NAME TALLYING CNT FOR ALL "n".
    DISPLAY CNT.
    STOP RUN.
