IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SCORE PIC 9(3) VALUE 75.
PROCEDURE DIVISION.
MAIN-PROC.
    EVALUATE SCORE
        WHEN 90 THRU 100
            DISPLAY 1
        WHEN 80 THRU 89
            DISPLAY 2
        WHEN 70 THRU 79
            DISPLAY 3
        WHEN OTHER
            DISPLAY 9
    END-EVALUATE.
    STOP RUN.
