IDENTIFICATION DIVISION.
PROGRAM-ID. IFCLASS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 AGE PIC 9(3) VALUE 25.
PROCEDURE DIVISION.
MAIN-PROC.
    IF AGE < 13 THEN
        DISPLAY 1
    ELSE
        IF AGE < 20 THEN
            DISPLAY 2
        ELSE
            DISPLAY 3
        END-IF
    END-IF.
    STOP RUN.
