IDENTIFICATION DIVISION.
PROGRAM-ID. JUMPER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9 VALUE 1.
PROCEDURE DIVISION.
MAIN-PROC.
    DISPLAY 1.
    IF N = 1 THEN
        GO TO LATER-PROC
    END-IF.
    DISPLAY 9.
LATER-PROC.
    DISPLAY 2.
    DISPLAY 3.
    STOP RUN.
