IDENTIFICATION DIVISION.
PROGRAM-ID. LOOKUP.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT EMP-FILE ASSIGN TO "/tmp/employees3.dat"
        ORGANIZATION IS INDEXED
        ACCESS MODE IS RANDOM
        RECORD KEY IS EMP-NAME.
DATA DIVISION.
FILE SECTION.
FD EMP-FILE.
01 EMP-REC.
    05 EMP-NAME PIC X(20).
    05 EMP-SALARY PIC 9(7)V99.
WORKING-STORAGE SECTION.
01 EOF-FLAG PIC X VALUE "N".
    88 EOF-REACHED VALUE "Y".
PROCEDURE DIVISION.
MAIN-PROC.
    OPEN INPUT EMP-FILE.
    MOVE "Bob" TO EMP-NAME.
    READ EMP-FILE AT END MOVE "Y" TO EOF-FLAG END-READ.
    IF EOF-REACHED THEN
        DISPLAY 0
    ELSE
        DISPLAY EMP-SALARY
    END-IF.
    CLOSE EMP-FILE.
    STOP RUN.
