IDENTIFICATION DIVISION.
PROGRAM-ID. RANGE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(3) VALUE 15.
01 M PIC 9(3) VALUE 5.
PROCEDURE DIVISION.
MAIN-PROC.
    IF N > 10 AND N < 20 AND M = 5 THEN
        DISPLAY 1
    END-IF.
    IF N = 0 OR M = 5 THEN
        DISPLAY 2
    END-IF.
    IF N > 100 OR M > 100 THEN
        DISPLAY 9
    ELSE
        DISPLAY 3
    END-IF.
    STOP RUN.
