IDENTIFICATION DIVISION.
PROGRAM-ID. STATUS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 RC PIC 9(3) VALUE 1.
    88 IS-OK VALUE 1.
    88 IS-WARN VALUE 2.
    88 IS-ERR VALUE 3.
PROCEDURE DIVISION.
MAIN-PROC.
    IF IS-OK THEN
        DISPLAY 1
    END-IF.
    MOVE 3 TO RC.
    IF IS-ERR THEN
        DISPLAY 2
    END-IF.
    IF IS-WARN THEN
        DISPLAY 9
    ELSE
        DISPLAY 3
    END-IF.
    STOP RUN.
