IDENTIFICATION DIVISION.
PROGRAM-ID. SUMARR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS PIC 9(3) OCCURS 5 TIMES.
01 IDX PIC 9(3) VALUE 0.
01 TOTAL PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
MAIN-PROC.
    MOVE 10 TO NUMS(1).
    MOVE 20 TO NUMS(2).
    MOVE 30 TO NUMS(3).
    MOVE 40 TO NUMS(4).
    MOVE 50 TO NUMS(5).
    PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 5
        ADD NUMS(IDX) TO TOTAL
    END-PERFORM.
    DISPLAY TOTAL.
    STOP RUN.
