IDENTIFICATION DIVISION.
PROGRAM-ID. SUMTO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 9(3) VALUE 0.
01 TOTAL PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN-PROC.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        ADD I TO TOTAL
    END-PERFORM.
    DISPLAY TOTAL.
    STOP RUN.
